export interface CameraKeyframe {
  name: string;
  time: number; // in seconds
  position: [number, number, number];
  rotation: [number, number, number];
  fov: number;
}

// ВАЖНО: Укажите здесь время (в секундах) для каждого ключевого кадра
export const cameraKeyframes: CameraKeyframe[] = [
  {
    name: 'переход на припев',
    time: 0,
    position: [
      -0.0005026479610804905, -39.988438539389165, 0.9616563465363814,
    ],
    rotation: [
      1.5467526015807316, -0.000012566199027343027, 0.0005225386735497837,
    ],
    fov: 115,
  },
  {
    name: 'переход на куплет',
    time: 5, // Пример
    position: [
      -25.315785474373126, -14.360174105071525, 27.43895780614764,
    ],
    rotation: [
      0.4821525120548994, -0.6852862161784273, 0.3198521308343608,
    ],
    fov: 85,
  },
  {
    name: 'переход на припев',
    time: 10, // Пример
    position: [6.084283834490385, 38.842844441532186, 7.363078562144257],
    rotation: [
      -1.3834583640065043, 0.1526998274153625, 0.6762140479066334,
    ],
    fov: 115,
  },
  {
    name: 'бридж',
    time: 15, // Пример
    position: [
      -12.395002992337378, 7.07571207265726, -33.158832902935956,
    ],
    rotation: [
      -2.931357346745999, -0.35048342480870553, -3.0684560076740555,
    ],
    fov: 145,
  },
  {
    name: 'финал',
    time: 20, // Пример
    position: [
      -16.099584455805015, -8.85753973737272, -31.0734190289915,
    ],
    rotation: [
      2.863905418523054, -0.46225979716147336, 3.0151457382609936,
    ],
    fov: 275,
  },
]; 